RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_i2s.c
/**
 *******************************************************************************
 * @file  hc32_ll_i2s.c
 * @brief This file provides firmware functions to manage the Inter IC Sound Bus
 *        (I2S).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_i2s.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_I2S I2S
 * @brief Inter IC Sound Bus Driver Library
 * @{
 */

#if (LL_I2S_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup I2S_Local_Macros I2S Local Macros
 * @{
 */
/* CMU registers define */
#define I2S_CLK_SRC_PCLK                (0x00U << CMU_I2SCKSEL_I2S1CKSEL_POS)
#define I2S_CLK_SRC_PLLP                (0x08U << CMU_I2SCKSEL_I2S1CKSEL_POS)
#define I2S_CLK_SRC_PLLQ                (0x09U << CMU_I2SCKSEL_I2S1CKSEL_POS)
#define I2S_CLK_SRC_PLLR                (0x0AU << CMU_I2SCKSEL_I2S1CKSEL_POS)
#define I2S_CLK_SRC_PLLXP               (0x0BU << CMU_I2SCKSEL_I2S1CKSEL_POS)
#define I2S_CLK_SRC_PLLXQ               (0x0CU << CMU_I2SCKSEL_I2S1CKSEL_POS)
#define I2S_CLK_SRC_PLLXR               (0x0DU << CMU_I2SCKSEL_I2S1CKSEL_POS)

#define I2S_CMU_PLLCFGR                 PLLCFGR
#define I2S_CMU_PLLCFGR_PLLSRC          CMU_PLLCFGR_PLLSRC

#define I2S_CMU_PLLXCFGR                UPLLCFGR

#define I2S_CMU_SCFGR                   SCFGR
#define I2S_CMU_SCFGR_PCLK              CMU_SCFGR_PCLK1S
#define I2S_CMU_SCFGR_PCLK_POS          CMU_SCFGR_PCLK1S_POS

#define I2S_CMU_PLLCFGR_PLLM            CMU_PLLCFGR_MPLLM
#define I2S_CMU_PLLCFGR_PLLM_POS        CMU_PLLCFGR_MPLLM_POS
#define I2S_CMU_PLLCFGR_PLLN            CMU_PLLCFGR_MPLLN
#define I2S_CMU_PLLCFGR_PLLN_POS        CMU_PLLCFGR_MPLLN_POS
#define I2S_CMU_PLLCFGR_PLLP            CMU_PLLCFGR_MPLLP
#define I2S_CMU_PLLCFGR_PLLP_POS        CMU_PLLCFGR_MPLLP_POS
#define I2S_CMU_PLLCFGR_PLLQ            CMU_PLLCFGR_MPLLQ
#define I2S_CMU_PLLCFGR_PLLQ_POS        CMU_PLLCFGR_MPLLQ_POS
#define I2S_CMU_PLLCFGR_PLLR            CMU_PLLCFGR_MPLLR
#define I2S_CMU_PLLCFGR_PLLR_POS        CMU_PLLCFGR_MPLLR_POS

#define I2S_CMU_PLLCFGR_PLLXM           CMU_UPLLCFGR_UPLLM
#define I2S_CMU_PLLCFGR_PLLXM_POS       CMU_UPLLCFGR_UPLLM_POS
#define I2S_CMU_PLLCFGR_PLLXN           CMU_UPLLCFGR_UPLLN
#define I2S_CMU_PLLCFGR_PLLXN_POS       CMU_UPLLCFGR_UPLLN_POS
#define I2S_CMU_PLLCFGR_PLLXP           CMU_UPLLCFGR_UPLLP
#define I2S_CMU_PLLCFGR_PLLXP_POS       CMU_UPLLCFGR_UPLLP_POS
#define I2S_CMU_PLLCFGR_PLLXQ           CMU_UPLLCFGR_UPLLQ
#define I2S_CMU_PLLCFGR_PLLXQ_POS       CMU_UPLLCFGR_UPLLQ_POS
#define I2S_CMU_PLLCFGR_PLLXR           CMU_UPLLCFGR_UPLLR
#define I2S_CMU_PLLCFGR_PLLXR_POS       CMU_UPLLCFGR_UPLLR_POS

/* I2S CTRL register Mask */
#define I2S_CTRL_CLR_MASK               (I2S_CTRL_WMS      | I2S_CTRL_ODD      | I2S_CTRL_MCKOE     | \
                                         I2S_CTRL_TXBIRQWL | I2S_CTRL_RXBIRQWL | I2S_CTRL_I2SPLLSEL | \
                                         I2S_CTRL_SDOE     | I2S_CTRL_LRCKOE   | I2S_CTRL_CKOE      | \
                                         I2S_CTRL_DUPLEX   | I2S_CTRL_CLKSEL)

/**
 * @defgroup I2S_Check_Parameters_Validity I2S Check Parameters Validity
 * @{
 */
#define IS_I2S_UNIT(x)                                                         \
(   ((x) == CM_I2S1)                            ||                             \
    ((x) == CM_I2S2)                            ||                             \
    ((x) == CM_I2S3)                            ||                             \
    ((x) == CM_I2S4))

#define IS_I2S_CLK_SRC(x)                                                      \
(   ((x) == I2S_CLK_SRC_PLL)                    ||                             \
    ((x) == I2S_CLK_SRC_EXT))

#define IS_I2S_MD(x)                                                           \
(   ((x) == I2S_MD_MASTER)                      ||                             \
    ((x) == I2S_MD_SLAVE))

#define IS_I2S_PROTOCOL(x)                                                     \
(   ((x) == I2S_PROTOCOL_PHILLIPS)              ||                             \
    ((x) == I2S_PROTOCOL_MSB)                   ||                             \
    ((x) == I2S_PROTOCOL_LSB)                   ||                             \
    ((x) == I2S_PROTOCOL_PCM_SHORT)             ||                             \
    ((x) == I2S_PROTOCOL_PCM_LONG))

#define IS_I2S_TRANS_MD(x)                                                     \
(   ((x) == I2S_TRANS_MD_HALF_DUPLEX_RX)        ||                             \
    ((x) == I2S_TRANS_MD_HALF_DUPLEX_TX)        ||                             \
    ((x) == I2S_TRANS_MD_FULL_DUPLEX))

#define IS_I2S_AUDIO_FREQ(x)                                                   \
(   ((x) == I2S_AUDIO_FREQ_DEFAULT)             ||                             \
    (((x) >= I2S_AUDIO_FREQ_8K) && ((x) <= I2S_AUDIO_FREQ_192K)))

#define IS_I2S_CH_LEN(x)                                                       \
(   ((x) == I2S_CH_LEN_16BIT)                   ||                             \
    ((x) == I2S_CH_LEN_32BIT))

#define IS_I2S_DATA_LEN(x)                                                     \
(   ((x) == I2S_DATA_LEN_16BIT)                 ||                             \
    ((x) == I2S_DATA_LEN_24BIT)                 ||                             \
    ((x) == I2S_DATA_LEN_32BIT))

#define IS_I2S_MCK_OUTPUT(x)                                                   \
(   ((x) == I2S_MCK_OUTPUT_DISABLE)             ||                             \
    ((x) == I2S_MCK_OUTPUT_ENABLE))

#define IS_I2S_TRANS_LVL(x)                                                    \
(   ((x) == I2S_TRANS_LVL0)                     ||                             \
    ((x) == I2S_TRANS_LVL1)                     ||                             \
    ((x) == I2S_TRANS_LVL2))

#define IS_I2S_RECEIVE_LVL(x)                                                  \
(   ((x) == I2S_RECEIVE_LVL0)                   ||                             \
    ((x) == I2S_RECEIVE_LVL1)                   ||                             \
    ((x) == I2S_RECEIVE_LVL2))

